"""
Даны значения величины заработной платы заемщиков банка (zp) и значения их
поведенческого кредитного скоринга (ks): zp = [35, 45, 190, 200, 40, 70, 54, 150, 120, 110],
ks = [401, 574, 874, 919, 459, 739, 653, 902, 746, 832].
Посчитать коэффициент линейной регрессии при заработной плате (zp), используя
градиентный спуск (без intercept).
"""
from numpy import *
import matplotlib.pyplot as plt

x = array([35, 45, 190, 200, 40, 70, 54, 150, 120, 110])
y = array([401, 574, 874, 919, 459, 739, 653, 902, 746, 832])
alpha = 1e-6
B1 = 0.1
n = 10
for i in range(350):
    B1 -= alpha * (2 / n) * sum((B1 * x - y) * x)
plt.scatter(x, y)
plt.title(f"Коэффициент B1 = {B1}")
plt.plot(x, B1 * x, label="без константы")
plt.legend(loc='upper center')
plt.show()
